# 04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

2273001 - Olivia Justine Audia

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.4
1.21.5

Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0          6.0         12
1          3.0         12
2         19.0         19
3          2.0          8
4         14.0         19

In [4]:
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00          6.0         12    A
1 2023-10-01 01:00:00          3.0         12    B
2 2023-10-01 02:00:00         19.0         19    C
3 2023-10-01 03:00:00          2.0          8    D
4 2023-10-01 04:00:00         14.0         19    E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Memilih kolom bertipe data numerik

In [6]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          6.0         12
1          3.0         12
2         19.0         19
3          2.0          8
4         14.0         19

In [7]:
df.select_dtypes(include='float')

   bil_pecahan
0          6.0
1          3.0
2         19.0
3          2.0
4         14.0

In [8]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1         12
2         19
3          8
4         19

Memilih kolom bertipe data string atau object

In [9]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

Memilih kolom bertipe data datetime

In [10]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

Memilih kolom dengan kombinasi tipe data

In [11]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          6.0         12    A
1          3.0         12    B
2         19.0         19    C
3          2.0          8    D
4         14.0         19    E